<div class="alert alert-block alert-info">
<center>ESTATÍSTICA APLICADA</center>
<center>LISTA 04</center>
<center>ALUNO: Luís Felipe Ferreira Tavares Nonato</center>
</div>

<div class="alert alert-block alert-info">
QUESTÃO 1
</div>

In [2]:
import pandas as pd
import numpy as np

Criando data frames

In [3]:
Mercearia = pd.DataFrame({"loja":["A", "A", "A"],
"dia": ["sex", "sab", "dom"],
"valor": [7500, 9500, 8200]})

Farmácia = pd.DataFrame({"loja":["B", "B", "B"],
"dia": ["sex", "sab", "dom"],
"valor": [5100, 8250, 9900]})

Restaurante = pd.DataFrame({"loja":["C", "C"],
"dia": ["sab", "dom"],
"valor": [7500, 11800]})

Vizualizando data frames

In [4]:
Mercearia

  loja  dia  valor
0    A  sex   7500
1    A  sab   9500
2    A  dom   8200

In [5]:
Farmácia

  loja  dia  valor
0    B  sex   5100
1    B  sab   8250
2    B  dom   9900

In [6]:
Restaurante

  loja  dia  valor
0    C  sab   7500
1    C  dom  11800

Concatenando os data frame

In [7]:
pd.concat([Mercearia, Farmácia, Restaurante], axis=1)

  loja  dia  valor loja  dia  valor loja  dia    valor
0    A  sex   7500    B  sex   5100    C  sab   7500.0
1    A  sab   9500    B  sab   8250    C  dom  11800.0
2    A  dom   8200    B  dom   9900  NaN  NaN      NaN

Concatenando pelas linhas em comum, gerando NaN's por conta que no Data Frame Restaurante não possui a linha 2.

In [8]:
pd.concat([Mercearia, Farmácia, Restaurante])

  loja  dia  valor
0    A  sex   7500
1    A  sab   9500
2    A  dom   8200
0    B  sex   5100
1    B  sab   8250
2    B  dom   9900
0    C  sab   7500
1    C  dom  11800

Concatenando pelas Colunas em comum, não gerando NaN's por conta que todos data frames possuem todas as colunas em comum.

<div class="alert alert-block alert-info">
QUESTÃO 2
</div>

Criando data frames

In [9]:
SQL = pd.DataFrame({"email":["rakesh@xyz.com",
"ecg@acmecorpus.com"]})
Criando data frames

PYTHON = pd.DataFrame({"email":["ana@xyz.com",
"jonas@acmecorpus.com",
"rakesh@xyz.com"]})

Mostrando data frames

In [10]:
SQL

                email
0      rakesh@xyz.com
1  ecg@acmecorpus.com

In [11]:
PYTHON

                  email
0           ana@xyz.com
1  jonas@acmecorpus.com
2        rakesh@xyz.com

<div class="alert alert-block alert-info">
a)
</div>

In [13]:
pd.concat([SQL,PYTHON]).drop_duplicates(keep=False)

                  email
1    ecg@acmecorpus.com
0           ana@xyz.com
1  jonas@acmecorpus.com

<div class="alert alert-block alert-info">
b)
</div>

In [26]:
df1 = pd.concat([SQL,PYTHON])

In [28]:
df1 = df1[df1.duplicated()]
df1

            email
2  rakesh@xyz.com

<div class="alert alert-block alert-info">
c)
</div>

Fez PYTHON mas não fez SQL

In [29]:
pd.concat([PYTHON,df1]).drop_duplicates(keep=False)

                  email
0           ana@xyz.com
1  jonas@acmecorpus.com

Fez SQL mas não fez PYTHON

In [30]:
pd.concat([SQL,df1]).drop_duplicates(keep=False)

                email
1  ecg@acmecorpus.com

<div class="alert alert-block alert-info">
QUESTÃO 3
</div>

Criando data frames

In [32]:
dic_emp = {"id":["D1","D2","D3","D4"],
"nomDepto": ["Compras","RH","TI","Vendas"],
"local":["SP","RJ","RJ","SP"]
}

dic_func = {"num":[3199,3269,3555,3788,3844],
"nome": ["Ana","David","José","Marina","Luís"],
"salario":[1600,2975,1500,5000,3000],
"idDepto": ["D2","D3",None,"D2","D4"]
}

empresa = pd.DataFrame(dic_emp)
funcionarios = pd.DataFrame(dic_func)

Vizualizando data frames

In [33]:
empresa

   id nomDepto local
0  D1  Compras    SP
1  D2       RH    RJ
2  D3       TI    RJ
3  D4   Vendas    SP

In [34]:
funcionarios

    num    nome  salario idDepto
0  3199     Ana     1600      D2
1  3269   David     2975      D3
2  3555    José     1500    None
3  3788  Marina     5000      D2
4  3844    Luís     3000      D4

Mudando nome da coluna do data frame para fazer merge

In [38]:
funcionarios.rename(columns={'idDepto':'id'}, inplace=True)
funcionarios

    num    nome  salario    id
0  3199     Ana     1600    D2
1  3269   David     2975    D3
2  3555    José     1500  None
3  3788  Marina     5000    D2
4  3844    Luís     3000    D4

Fazendo merge

In [39]:
pd.merge(empresa, funcionarios, on='id')

   id nomDepto local   num    nome  salario
0  D2       RH    RJ  3199     Ana     1600
1  D2       RH    RJ  3788  Marina     5000
2  D3       TI    RJ  3269   David     2975
3  D4   Vendas    SP  3844    Luís     3000